// Импортируем установленные библиотеки
const express = require('express');
const cors = require('cors');

// Импортируем роутер
const todoRouter = require('./routes/todos');

// Создаем приложение (наш сервер)
const app = express();

// Указываем порт (дверь), через которую будем общаться
const PORT = 3000;

// -- НАСТРОЙКИ --
// Разрешаем браузеру отправлять запросы с других адресов
app.use(cors());
// Учим сервер понимать JSON (данные, которые пришлет фронтенд)
app.use(express.json());

// Если адрес начнается с /todos, иди в todoRouter
app.use('/todos', todoRouter);

app.listen(PORT, () => {
    console.log(`🚀 Сервер запущен! Жду команд на http://localhost:${PORT}`);
});

